src/InformationRegisters/ar_Запуски.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ar_Запуски</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ar_Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ar_СтатусЗапуска</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ОтветLLM</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_АгентРеф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ar_Агенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_СтартовалВ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ЗавершенВ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_Триггер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПользовательРеф</Name>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ТокеновВход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ТокеновВыход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_СтоимостьРуб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ШаговВсего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_РодительскийИдентификаторЗапуска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_StateSnapshot</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПоследнийПульс</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПрофильЗапуска</Name>
					<Comment>Профиль запуска (CONS-01), определивший ответственного и область данных этого запуска. Пустая ссылка — профиль не указан (обратная совместимость, CONS-02).</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ar_ПрофилиЗапуска</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПопытокВозобновления</Name>
					<Comment>Счётчик повторов техсбоя (§3.5) и предохранитель третьего слоя детекции прогресса — потолок 10 продолжений (§3.3, CONS-11). Заполняется ar_Планировщик.ОбработатьАвтовозобновление (CONS-09).</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПродолженийСделано</Name>
					<Comment>CONS-11: счётчик фактических продолжений цикла по вердикту Продолжить надзора (§3.3) — предохранитель слоя 3, потолок 10. НЕ путать с ar_ПопытокВозобновления (CONS-09, счётчик техповторов, потолок 3) — разные счётчики по решению аналитика/оркестратора, во избежание рассинхрона двух независимых механизмов. Не сбрасывается при автовозобновлении техсбоя (ar_Планировщик.ОбработатьАвтовозобновление).</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПоследнееРешениеНадзора</Name>
					<Comment>Каноническое имя значения ar_ВердиктНадзора (или пусто, если надзор ещё не вызывался) — хранится строкой, а не ссылкой на перечисление, чтобы консоль показывала решение без join (план §5.1). Заполняется ar_Надзор (CONS-10).</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ОтпечатокШага</Name>
					<Comment>Хэш «имя tool + хэш аргументов + хэш результата» последнего шага — основа result-aware детекции застревания (§3.3, CONS-11). 64 символа — под hex SHA-256.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПовторитьПосле</Name>
					<Comment>Момент следующей попытки при временном техсбое (сеть, таймаут, 429/5xx); пусто — повтор не запланирован (§3.5). Читает и пишет ar_Планировщик.ОбработатьАвтовозобновление (CONS-09).</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ТекущийЭтап</Name>
					<Comment>PLAN-01: название текущего этапа плана (заголовок пункта) — для быстрого отображения без join (план §5.1). Заполняется ar_RuntimeЦикл (PLAN-04) из ar_ПланЗапуска.ТекущийПункт (PLAN-02, пока не реализован). Полный план не хранится в регистре — восстанавливается из последнего события PlanUpdated в ar_СобытияЗапуска. Пусто для запусков без плана.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ЭтаповВсего</Name>
					<Comment>PLAN-01: общее количество этапов плана. Заполняется ar_RuntimeЦикл (PLAN-04) из ar_ПланЗапуска.Прогресс (PLAN-02, пока не реализован). 0 — план не объявлен или запуск без планирования. Миграция существующих записей не требуется.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ЭтаповЗакрыто</Name>
					<Comment>PLAN-01: количество завершённых этапов плана. Заполняется ar_RuntimeЦикл (PLAN-04) из ar_ПланЗапуска.Прогресс (PLAN-02, пока не реализован). 0 — план не объявлен или запуск без планирования. Миграция существующих записей не требуется.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ОжидаетСобытия</Name>
					<Comment>PLAN-10: JSON-строка вида {\"object_type\": \"Справочник.Контрагенты\", \"filter\": {\"Наименование\": \"ООО Ромашка\"}} - тип объекта + плоский фильтр без операторов, по аналогии с ar_ОбработчикПодписок.ГорячиеТипы/ПроверитьФильтр. Заполняется ar_RuntimeЦикл/ar_ИнструментыПлан при вызове tool wait_for_event(object_type, filter, deadline_hours) (PLAN-11, пока не реализован). Пусто, если запуск не в PausedForEvent. Миграция существующих записей не требуется.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ОжиданиеДо</Name>
					<Comment>PLAN-10: дедлайн ожидания события, DateTime (точность до секунды - deadline_hours в часах, PLAN-11). Заполняется ar_RuntimeЦикл при вызове tool wait_for_event как ТекущаяДата() + deadline_hours часов (PLAN-11, пока не реализован). Сравнивается с ТекущаяДата() в регламентном задании проверки дедлайна (PLAN-13). Пусто, если запуск не в PausedForEvent. Миграция существующих записей не требуется.</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_Диалог</Name>					<Type>
						<v8:Type>cfg:CatalogRef.ar_Диалоги</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_Предмет</Name>					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ar_ИдентификаторЗапуска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ar_ДействияАгента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ar_ДействияАгента</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ar_ИмяИнструмента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_АргументыJSON</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_УровеньРиска</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ar_УровеньРиска</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_СсылкаНаРезультат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_КемПодтверждено</Name>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ДатаПодтверждения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ДлительностьМС</Name>
					<Comment>Длительность вызова tool в миллисекундах: от начала выполнения реализации до возврата результата или исключения. Заполняется ВСЕГДА, независимо от флага ar_ЗамерПроизводительности и наличия подсистемы БСП "Оценка производительности". 0 означает "не измерено" (например запись создана не из ar_ИнструментыДиспетчер.Вызвать). PERF-04.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ЗавершёнСОшибкой</Name>
					<Comment>Вызов завершился ошибкой: исключение реализации либо observation с ключом "error". Нужен для статистики PERF-05 - сам текст observation в регистре не хранится, восстановить признак постфактум нельзя.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ar_ИдентификаторЗапуска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ar_Последовательность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/ar_ДиагностикаОчистка/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// AgentRunner для 1С
//
// Copyright (C) 2026 Samolet
//
// Лицензия: GNU GPLv3. Полный текст — в файле LICENSE в корне репозитория,
// также: https://www.gnu.org/licenses/gpl-3.0.html
//
// Исходный код проекта:
// https://github.com/AI-1C-Expert/agentrunner
///////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
// Общий модуль ar_ДиагностикаОчистка.
//
// Сбор служебной информации AgentRunner в текстовый документ (для анализа) и
// очистка служебных регистров/справочников по кнопкам формы ОбщаяФорма.ar_Диалог.
//
// Источники (все служебные объекты расширения, кроме ar_ХранилищеСекретов -
// оно намеренно исключено из выгрузки и очистки, т.к. хранит секреты
// провайдеров LLM):
//   РегистрСведений.ar_СобытияЗапуска, ar_Сессии, ar_Запуски, ar_ДействияАгента,
//   ar_МетрикиLLM, ar_ОчередьApproval, ar_ЗапрещённыеОбъекты,
//   ar_ПереопределенияОбъектов, ar_ПравилаМаскированияПДн;
//   Справочник.ar_ПамятьАгента.
//
// Очистка выполняется в привилегированном режиме (аналог ar_AuditЗащищённыйРежим -
// см. Plan §1.3): рядовые роли (ar_РольОператор/ar_РольАдмин) имеют на большинство
// этих регистров только Read/View, точечный подъём привилегий здесь оправдан
// тем же контрактом, что и плановая компакция ar_Планировщик.ОбработатьКомпакциюAudit.
//
// Запрещено: Выполнить(), Вычислить() (Plan §1.3).
//
// См. спеку: .docs/specs/UI-22-log-tools.md.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Собирает служебную информацию по всем audit/служебным объектам расширения в
// текстовый документ, удобный для последующего построчного анализа.
//
// Выполняется в привилегированном режиме (точечно, try/finally) - большинство
// ролей (ar_РольОператор/ar_РольЧитатель/ar_РольАдмин) не имеют Read на все
// служебные регистры (например, ar_Сессии, ar_МетрикиLLM), т.к. эти объекты
// не предназначены для прямого просмотра пользователем. Права ролей ради
// одной диагностической кнопки не расширяем - доступ идёт через этот фасад,
// тем же контрактом, что и ar_AuditЗащищённыйРежим.
//
// Возвращаемое значение:
//   ТекстовыйДокумент - готовый к показу/сохранению документ.
//
Функция СобратьСлужебныйЛог() Экспорт

	Документ = Новый ТекстовыйДокумент;

	Документ.ДобавитьСтроку("AgentRunner - служебный лог");
	Документ.ДобавитьСтроку("Версия расширения: " + ar_Утилиты.ВерсияРасширения());
	Документ.ДобавитьСтроку("Сформирован: " + Формат(ТекущаяДатаСеанса(), "ДФ='yyyy-MM-dd HH:mm:ss'"));
	Документ.ДобавитьСтроку("Пользователь: " + ИмяТекущегоПользователя());
	Документ.ДобавитьСтроку(Разделитель());

	УстановитьПривилегированныйРежим(Истина);
	Попытка

		ДобавитьРазделРегистра(Документ, "РегистрСведений.ar_СобытияЗапуска", ЗапросСобытияЗапуска());
		ДобавитьРазделРегистра(Документ, "РегистрСведений.ar_Сессии", ЗапросСессии());
		ДобавитьРазделРегистра(Документ, "РегистрСведений.ar_Запуски", ЗапросЗапуски());
		ДобавитьРазделРегистра(Документ, "РегистрСведений.ar_ДействияАгента", ЗапросДействияАгента());
		ДобавитьРазделРегистра(Документ, "РегистрСведений.ar_МетрикиLLM", ЗапросМетрикиLLM());
		ДобавитьРазделРегистра(Документ, "РегистрСведений.ar_ОчередьApproval", ЗапросОчередьApproval());
		ДобавитьРазделРегистра(Документ, "РегистрСведений.ar_ЗапрещённыеОбъекты", ЗапросЗапрещённыеОбъекты());
		ДобавитьРазделРегистра(Документ, "РегистрСведений.ar_ПереопределенияОбъектов", ЗапросПереопределенияОбъектов());
		ДобавитьРазделРегистра(Документ, "РегистрСведений.ar_ПравилаМаскированияПДн", ЗапросПравилаМаскированияПДн());
		ДобавитьРазделРегистра(Документ, "Справочник.ar_ПамятьАгента", ЗапросПамятьАгента());
		ДобавитьРазделРегистра(Документ, "РегистрСведений.ar_СлужебныйЛог (SESS-08)", ЗапросСлужебныйЛог());

	Исключение
		УстановитьПривилегированныйРежим(Ложь);
		ВызватьИсключение;
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);

	Возврат Документ;

КонецФункции

// Очищает все служебные регистры/справочники расширения (кроме
// ar_ХранилищеСекретов). Выполняется в привилегированном режиме, точечно,
// с гарантированным сбросом (try/finally).
//
// Возвращаемое значение:
//   Структура - {УспехОбщий (Булево), ВсегоУдалено (Число), Ошибки (Массив Строк)}.
//
Функция ОчиститьСлужебныеДанные() Экспорт

	Результат = Новый Структура;
	Результат.Вставить("УспехОбщий",   Истина);
	Результат.Вставить("ВсегоУдалено", 0);
	Результат.Вставить("Ошибки",       Новый Массив);

	УстановитьПривилегированныйРежим(Истина);
	Попытка

		Результат.ВсегоУдалено = Результат.ВсегоУдалено
			+ ОчиститьРегистрСведений(Результат, "ar_СобытияЗапуска");
		Результат.ВсегоУдалено = Результат.ВсегоУдалено
			+ ОчиститьРегистрСведений(Результат, "ar_Сессии");
		Результат.ВсегоУдалено = Результат.ВсегоУдалено
			+ ОчиститьРегистрСведений(Результат, "ar_Запуски");
		Результат.ВсегоУдалено = Результат.ВсегоУдалено
			+ ОчиститьРегистрСведений(Результат, "ar_ДействияАгента");
		Результат.ВсегоУдалено = Результат.ВсегоУдалено
			+ ОчиститьРегистрСведений(Результат, "ar_МетрикиLLM");
		Результат.ВсегоУдалено = Результат.ВсегоУдалено
			+ ОчиститьРегистрСведений(Результат, "ar_ОчередьApproval");
		Результат.ВсегоУдалено = Результат.ВсегоУдалено
			+ ОчиститьРегистрСведений(Результат, "ar_СлужебныйЛог");

	Исключение
		УстановитьПривилегированныйРежим(Ложь);
		Результат.УспехОбщий = Ложь;
		Результат.Ошибки.Добавить(ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Результат;
	КонецПопытки;

	// Итоговое audit-событие пишем после снятия привилегий этой функции -
	// ЗаписатьСобытиеПривилегированно сама точечно поднимает/сбрасывает режим.
	УстановитьПривилегированныйРежим(Ложь);

	Если Результат.Ошибки.Количество() > 0 Тогда
		Результат.УспехОбщий = Ложь;
	КонецЕсли;

	ПараметрыСобытия = Новый Структура;
	ПараметрыСобытия.Вставить("deleted_rows",   Результат.ВсегоУдалено);
	ПараметрыСобытия.Вставить("triggered_by",   "manual_ui");
	ПараметрыСобытия.Вставить("initiator",      ИмяТекущегоПользователя());
	ar_AuditЗащищённыйРежим.ЗаписатьСобытиеПривилегированно("", "АудитОчищен", ПараметрыСобытия);

	Возврат Результат;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Сбор лога - запросы источников.

Функция ЗапросСобытияЗапуска()
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	С.ar_RunId       КАК RunId,
		|	С.ar_Sequence    КАК Sequence,
		|	С.ar_МоментВремени КАК МоментВремени,
		|	С.ar_ТипСобытия  КАК ТипСобытия,
		|	С.ar_PayloadJSON КАК PayloadJSON
		|ИЗ
		|	РегистрСведений.ar_СобытияЗапуска КАК С
		|УПОРЯДОЧИТЬ ПО
		|	С.ar_МоментВремени УБЫВ";
	Возврат Запрос;
КонецФункции

Функция ЗапросСессии()
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	С.ar_Агент     КАК Агент,
		|	С.ar_Якорь     КАК Якорь,
		|	С.ar_ПоследнийИдентификаторЗапуска КАК LastRunId,
		|	С.ar_Активна   КАК Активна,
		|	С.ar_Создана   КАК Создана,
		|	С.ar_Обновлена КАК Обновлена,
		|	С.ar_Пользователь КАК Пользователь,
		|	С.ar_РодительскийЯкорь КАК РодительскийЯкорь
		|ИЗ
		|	РегистрСведений.ar_Сессии КАК С
		|УПОРЯДОЧИТЬ ПО
		|	С.ar_Обновлена УБЫВ";
	Возврат Запрос;
КонецФункции

Функция ЗапросЗапуски()
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	З.ar_ИдентификаторЗапуска КАК RunId,
		|	З.ar_Статус         КАК Статус,
		|	З.ar_АгентРеф       КАК Агент,
		|	З.ar_СтартовалВ     КАК СтартовалВ,
		|	З.ar_ЗавершенВ      КАК ЗавершенВ,
		|	З.ar_Триггер        КАК Триггер,
		|	З.ar_ТокеновВход    КАК ТокеновВход,
		|	З.ar_ТокеновВыход   КАК ТокеновВыход,
		|	З.ar_СтоимостьРуб   КАК СтоимостьРуб,
		|	З.ar_ШаговВсего     КАК ШаговВсего,
		|	З.ar_РодительскийИдентификаторЗапуска КАК РодительскийRunId,
		|	З.ar_ПоследнийПульс  КАК LastHeartbeat
		|ИЗ
		|	РегистрСведений.ar_Запуски КАК З
		|УПОРЯДОЧИТЬ ПО
		|	З.ar_СтартовалВ УБЫВ";
	Возврат Запрос;
КонецФункции

Функция ЗапросДействияАгента()
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Д.ar_ИдентификаторЗапуска        КАК RunId,
		|	Д.ar_Последовательность     КАК Sequence,
		|	Д.ar_ИмяИнструмента КАК ИмяИнструмента,
		|	Д.ar_АргументыJSON КАК АргументыJSON,
		|	Д.ar_УровеньРиска    КАК RiskLevel,
		|	Д.ar_СсылкаНаРезультат    КАК ResultRef,
		|	Д.ar_КемПодтверждено   КАК ApprovedBy,
		|	Д.ar_ДатаПодтверждения   КАК ApprovedAt
		|ИЗ
		|	РегистрСведений.ar_ДействияАгента КАК Д
		|УПОРЯДОЧИТЬ ПО
		|	Д.ar_ИдентификаторЗапуска, Д.ar_Последовательность";
	Возврат Запрос;
КонецФункции

Функция ЗапросМетрикиLLM()
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	М.ar_RunId        КАК RunId,
		|	М.ar_Sequence     КАК Sequence,
		|	М.ar_Провайдер    КАК Провайдер,
		|	М.ar_ТипПровайдера КАК ТипПровайдера,
		|	М.ar_Модель       КАК Модель,
		|	М.ar_LatencyMs    КАК LatencyMs,
		|	М.ar_ТокеновВход  КАК ТокеновВход,
		|	М.ar_ТокеновВыход КАК ТокеновВыход,
		|	М.ar_Стоимость    КАК Стоимость
		|ИЗ
		|	РегистрСведений.ar_МетрикиLLM КАК М
		|УПОРЯДОЧИТЬ ПО
		|	М.ar_RunId, М.ar_Sequence";
	Возврат Запрос;
КонецФункции

Функция ЗапросОчередьApproval()
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	О.ar_ApprovalId    КАК ApprovalId,
		|	О.ar_RunId         КАК RunId,
		|	О.ar_Sequence      КАК Sequence,
		|	О.ar_ActionPayloadJSON КАК ActionPayloadJSON,
		|	О.ar_Статус        КАК Статус,
		|	О.ar_ОбоснованиеLLM КАК ОбоснованиеLLM,
		|	О.ar_СозданоВ      КАК СозданоВ,
		|	О.ar_РешеноВ       КАК РешеноВ,
		|	О.ar_РешилПользователь КАК РешилПользователь,
		|	О.ar_IdempotencyKey КАК IdempotencyKey
		|ИЗ
		|	РегистрСведений.ar_ОчередьApproval КАК О
		|УПОРЯДОЧИТЬ ПО
		|	О.ar_СозданоВ УБЫВ";
	Возврат Запрос;
КонецФункции

Функция ЗапросЗапрещённыеОбъекты()
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	З.ТипОбъекта     КАК ТипОбъекта,
		|	З.РежимЗапрета   КАК РежимЗапрета,
		|	З.Включен        КАК Включен,
		|	З.Причина        КАК Причина,
		|	З.КонкретнаяСсылка КАК КонкретнаяСсылка
		|ИЗ
		|	РегистрСведений.ar_ЗапрещённыеОбъекты КАК З";
	Возврат Запрос;
КонецФункции

Функция ЗапросПереопределенияОбъектов()
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	П.ar_ЛогическоеИмя  КАК ЛогическоеИмя,
		|	П.ar_ИмяВМетаданных КАК ИмяВМетаданных
		|ИЗ
		|	РегистрСведений.ar_ПереопределенияОбъектов КАК П";
	Возврат Запрос;
КонецФункции

Функция ЗапросПравилаМаскированияПДн()
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	П.Объект             КАК Объект,
		|	П.ИмяПоля            КАК ИмяПоля,
		|	П.Включён            КАК Включён,
		|	П.СпособМаскирования КАК СпособМаскирования,
		|	П.Причина            КАК Причина,
		|	П.Автор              КАК Автор,
		|	П.Создано            КАК Создано
		|ИЗ
		|	РегистрСведений.ar_ПравилаМаскированияПДн КАК П";
	Возврат Запрос;
КонецФункции

Функция ЗапросПамятьАгента()
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	П.Ссылка            КАК Ссылка,
		|	П.ar_Агент          КАК Агент,
		|	П.ar_ВладелецКлюч   КАК ВладелецКлюч,
		|	П.ar_Текст          КАК Текст,
		|	П.ar_Тип            КАК Тип,
		|	П.ar_КлючевыеСлова  КАК КлючевыеСлова,
		|	П.ar_Источник       КАК Источник,
		|	П.ar_ИсточникИдентификаторЗапуска  КАК ИсточникRunId,
		|	П.ar_Создано        КАК Создано,
		|	П.ar_Обновлено      КАК Обновлено
		|ИЗ
		|	Справочник.ar_ПамятьАгента КАК П
		|УПОРЯДОЧИТЬ ПО
		|	П.ar_Создано УБЫВ";
	Возврат Запрос;
КонецФункции

Функция ЗапросСлужебныйЛог()
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Л.ar_Момент        КАК Момент,
		|	Л.ar_Источник      КАК Источник,
		|	Л.ar_Событие       КАК Событие,
		|	Л.ar_Уровень       КАК Уровень,
		|	Л.ar_RunId         КАК RunId,
		|	Л.ar_ОбъектСсылка  КАК ОбъектСсылка,
		|	Л.ar_Текст         КАК Текст
		|ИЗ
		|	РегистрСведений.ar_СлужебныйЛог КАК Л
		|УПОРЯДОЧИТЬ ПО
		|	Л.ar_Момент УБЫВ";
	Возврат Запрос;
КонецФункции

// Добавляет в документ один раздел лога: заголовок + построчный вывод всех
// колонок результата запроса + счётчик строк. Каждое строковое/JSON-значение
// пропускается через ar_Утилиты.МаскироватьСекреты - дополнительный барьер на
// случай, если в payload оказалось что-то, не покрытое маскированием при записи.
//
Процедура ДобавитьРазделРегистра(Документ, Знач Заголовок, Знач Запрос)

	Документ.ДобавитьСтроку(Заголовок);
	Документ.ДобавитьСтроку(СтрокаРазделительРаздела(СтрДлина(Заголовок)));

	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Документ.ДобавитьСтроку("(нет записей)");
		Документ.ДобавитьСтроку(Разделитель());
		Возврат;
	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();
	ИменаКолонок = Новый Массив;
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		ИменаКолонок.Добавить(Колонка.Имя);
	КонецЦикла;

	// Лимит на раздел - защита UI от подвисания при аномально большом объёме
	// накопленных служебных данных (см. МаксСтрокНаРаздел).
	МаксСтрокНаРаздел = 5000;
	КоличествоСтрок    = 0;
	Пока Выборка.Следующий() И КоличествоСтрок < МаксСтрокНаРаздел Цикл
		КоличествоСтрок = КоличествоСтрок + 1;
		Для Каждого ИмяКолонки Из ИменаКолонок Цикл
			Значение = Выборка[ИмяКолонки];
			Документ.ДобавитьСтроку("  " + ИмяКолонки + ": " + ЗначениеВСтроку(Значение));
		КонецЦикла;
		Документ.ДобавитьСтроку("");
	КонецЦикла;

	Если КоличествоСтрок >= МаксСтрокНаРаздел Тогда
		Документ.ДобавитьСтроку(СтрШаблон(
			"... (показаны первые %1 записей, остальные обрезаны)", МаксСтрокНаРаздел));
	КонецЕсли;

	Документ.ДобавитьСтроку(СтрШаблон("Всего записей в выгрузке: %1", КоличествоСтрок));
	Документ.ДобавитьСтроку(Разделитель());

КонецПроцедуры

// Приводит произвольное значение поля запроса к строке, пригодной для
// текстового лога: маскирует секреты в строковых значениях, разворачивает
// ссылки в их строковое представление.
//
Функция ЗначениеВСтроку(Знач Значение)

	Если Значение = Неопределено Тогда
		Возврат "";
	ИначеЕсли ТипЗнч(Значение) = Тип("Строка") Тогда
		Возврат ar_Утилиты.МаскироватьСекреты(Значение);
	ИначеЕсли ТипЗнч(Значение) = Тип("Дата") Тогда
		Возврат Формат(Значение, "ДФ='yyyy-MM-dd HH:mm:ss'");
	Иначе
		Возврат ar_Утилиты.МаскироватьСекреты(Строка(Значение));
	КонецЕсли;

КонецФункции

Функция Разделитель()
	Возврат Символы.ПС;
КонецФункции

// Строка из символов "-" заданной длины (подчёркивание заголовка раздела).
// Не полагаемся на непроверенные "функции повтора строки" - явный цикл.
//
Функция СтрокаРазделительРаздела(Знач Длина)

	Результат = "";
	Для Индекс = 1 По Длина Цикл
		Результат = Результат + "-";
	КонецЦикла;
	Возврат Результат;

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Очистка - удаление по регистрам и справочнику.

// Порционно удаляет все записи одного регистра сведений по его имени.
// Регистр обязан иметь ровно одно или два измерения (все служебные регистры
// расширения этому условию удовлетворяют - см. заголовок модуля).
//
Функция ОчиститьРегистрСведений(Результат, Знач ИмяРегистра)

	Попытка
		Возврат УдалитьВсеЗаписиРегистра(ИмяРегистра);
	Исключение
		Результат.Ошибки.Добавить(СтрШаблон("%1: %2",
			ИмяРегистра,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())));
		Возврат 0;
	КонецПопытки;

КонецФункции

// Читает все ключевые поля (измерения) регистра порциями по 1000 и удаляет
// записи через пустой набор с заданным отбором - стандартный платформенный
// паттерн (см. ar_Планировщик.УдалитьУстаревшиеСобытияПорцией).
//
Функция УдалитьВсеЗаписиРегистра(Знач ИмяРегистра) Экспорт

	МенеджерРегистра  = РегистрыСведений[ИмяРегистра];
	МетаданныеРегистра = Метаданные.РегистрыСведений.Найти(ИмяРегистра);

	ИменаИзмерений = Новый Массив;
	Для Каждого Измерение Из МетаданныеРегистра.Измерения Цикл
		ИменаИзмерений.Добавить(Измерение.Имя);
	КонецЦикла;

	ТекстПоляВыборки  = "";
	ТекстУпорядочивания = "";
	Для Каждого ИмяИзм Из ИменаИзмерений Цикл
		Если НЕ ПустаяСтрока(ТекстПоляВыборки) Тогда
			ТекстПоляВыборки  = ТекстПоляВыборки + ", ";
			ТекстУпорядочивания = ТекстУпорядочивания + ", ";
		КонецЕсли;
		ТекстПоляВыборки  = ТекстПоляВыборки  + "Р." + ИмяИзм + " КАК " + ИмяИзм;
		ТекстУпорядочивания = ТекстУпорядочивания + "Р." + ИмяИзм;
	КонецЦикла;

	ТекстЗапроса = СтрШаблон(
		"ВЫБРАТЬ ПЕРВЫЕ 1000 %1 ИЗ РегистрСведений.%2 КАК Р УПОРЯДОЧИТЬ ПО %3",
		ТекстПоляВыборки, ИмяРегистра, ТекстУпорядочивания);

	ВсегоУдалено = 0;
	МаксИтераций = 1000;
	НомерИтерации = 0;

	Пока НомерИтерации < МаксИтераций Цикл
		НомерИтерации = НомерИтерации + 1;

		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;

		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Прервать;
		КонецЕсли;

		Выборка = РезультатЗапроса.Выбрать();
		УдаленоВПорции = 0;
		Пока Выборка.Следующий() Цикл
			НаборЗаписей = МенеджерРегистра.СоздатьНаборЗаписей();
			Для Каждого ИмяИзм Из ИменаИзмерений Цикл
				НаборЗаписей.Отбор[ИмяИзм].Использование = Истина;
				НаборЗаписей.Отбор[ИмяИзм].Значение = Выборка[ИмяИзм];
			КонецЦикла;
			// Записываем пустой набор - удаление записи регистра сведений (стандартный паттерн).
			НаборЗаписей.Записать();
			УдаленоВПорции = УдаленоВПорции + 1;
		КонецЦикла;

		ВсегоУдалено = ВсегоУдалено + УдаленоВПорции;
		Если УдаленоВПорции = 0 Тогда
			Прервать;
		КонецЕсли;

	КонецЦикла;

	Возврат ВсегоУдалено;

КонецФункции

// Удаляет все элементы справочника ar_ПамятьАгента порциями по 1000.
//
Функция ОчиститьСправочникПамятьАгента(Результат)

	Попытка

		ВсегоУдалено = 0;
		МаксИтераций = 1000;
		НомерИтерации = 0;

		Пока НомерИтерации < МаксИтераций Цикл
			НомерИтерации = НомерИтерации + 1;

			Запрос = Новый Запрос;
			Запрос.Текст =
				"ВЫБРАТЬ ПЕРВЫЕ 1000
				|	П.Ссылка КАК Ссылка
				|ИЗ
				|	Справочник.ar_ПамятьАгента КАК П
				|УПОРЯДОЧИТЬ ПО
				|	П.Ссылка";

			РезультатЗапроса = Запрос.Выполнить();
			Если РезультатЗапроса.Пустой() Тогда
				Прервать;
			КонецЕсли;

			Выборка = РезультатЗапроса.Выбрать();
			УдаленоВПорции = 0;
			Пока Выборка.Следующий() Цикл
				Объект = Выборка.Ссылка.ПолучитьОбъект();
				Если Объект <> Неопределено Тогда
					Объект.Удалить();
					УдаленоВПорции = УдаленоВПорции + 1;
				КонецЕсли;
			КонецЦикла;

			ВсегоУдалено = ВсегоУдалено + УдаленоВПорции;
			Если УдаленоВПорции = 0 Тогда
				Прервать;
			КонецЕсли;

		КонецЦикла;

		Возврат ВсегоУдалено;

	Исключение
		Результат.Ошибки.Добавить(СтрШаблон("ar_ПамятьАгента: %1",
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())));
		Возврат 0;
	КонецПопытки;

КонецФункции

// Имя текущего пользователя ИБ для заголовка лога и audit payload.
// Не Пользователи.ТекущийПользователь() (справочник Пользователи не заимствован
// в расширение - см. комментарий в ar_Диалог.Ext/Form/Module.bsl) - используем
// платформенный ПользователиИнформационнойБазы.
//
Функция ИмяТекущегоПользователя()

	ТекущийПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
	Если ТекущийПользовательИБ = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	Возврат ТекущийПользовательИБ.Имя;

КонецФункции

#КонецОбласти
